app/Http/Controllers/AlbumsController.php

select count(*) as aggregate from `albums` where `user_id` = 51 and `albums`.`deleted_at` is null
---
    public function index(Request $request)
    {
        $albumsPerPage = config('filesystems.album_per_page');
        $queryBuilder = Album::orderBy('id', 'DESC')
        ->withCount('photos');
        $queryBuilder->where('user_id', Auth::id());
        if ($request->has('id')) {
            $queryBuilder->where('id', '=', $request->input('id'));
        }
        if ($request->has('album_name')) {
            $queryBuilder->where('album_name', 'like', $request->input('album_name') . '%');
        }
        if ($request->has('category_id')) {
            $queryBuilder->whereHas('categories', fn( $q) => $q->where('category_id',$request->category_id)) ;
        }
        $albums = $queryBuilder->paginate($albumsPerPage);

insert into `albums` (`album_name`, `description`, `user_id`, `album_thumb`, `updated_at`, `created_at`) values ('Nuovo Album Test', 'ciao', 51, '/', '2023-08-02 13:33:18', '2023-08-02 13:33:18')
---
    public function store(AlbumRequest $request)
    {
        $this->authorize(Album::class);
        $data = $request->only(['album_name', 'description']);
        $album = new Album();
        $album->album_name = $data['album_name'];
        $album->description = $data['description'];
        $album->user_id = Auth::id();
        $album->album_thumb = '/';
        $res = $album->save();

update `albums` set `album_thumb` = 'images/album_thumbs/1002.jpg', `albums`.`updated_at` = '2023-08-02 13:33:18' where `id` = 1002
---
    public function processFile ( Request $request, Album $album)
    {
        $file = $request->file('album_thumb');
        $filename= $album ->id.'.'.$file->extension();
        $thumbnail= $file ->storeAs(config('filesystems.album_thumbnail_dir'), $filename );
        $album->album_thumb = $thumbnail;
        $album->save();