app/Http/Controllers/CategoryController.php

    public function index()
{
    $user = auth()->user();

    $categories = Category::getCategoriesByUserId(auth()->user())->paginate(10);
---
select count(*) as aggregate from `categories` where `user_id` = 51

    public function store(Request $request)
    {
        $this->validate($request, $this->rules,$this->messages);
      $res =  Category::create([
           'category_name' => $request->category_name,
           'user_id' => auth()->id()
       ]);
---
insert into `categories` (`category_name`, `user_id`, `updated_at`, `created_at`) values ('Test New Category', 51, '2023-08-02 14:36:18', '2023-08-02 14:36:18')

    public function update(Request $request, Category $category)
    {
        $this->validate($request, $this->rules, $this->messages);
         $category->category_name = $request->category_name;
        $res = $category->save();
---
update `categories` set `category_name` = 'Test 3', `categories`.`updated_at` = '2023-08-02 13:13:49' where `id` = 37

    public function destroy(Category $category, Request $request)
    {
        $res = $category->delete();
---
delete from `categories` where `id` = 46