app/Http/Controllers/GalleryController.php

    public function index()
    {
        return view('gallery.albums')->with('albums', Album::latest()->paginate(20));
---
select * from `albums` where `albums`.`deleted_at` is null order by `created_at` desc limit 20 offset 0
select count(*) as aggregate from `albums` where `albums`.`deleted_at` is null