app/Http/Controllers/PhotosController.php

    public function getAlbums() : Collection
    {
        return Album::orderBy('album_name')->select(['id', 'album_name'])->get();
---
select `id`, `album_name` from `albums` where `albums`.`deleted_at` is null order by `album_name` asc